1. Create a pandas DataFrame having the following structure:
float_col int_col str_col
0 0.1 1 a
1 0.2 2 b
2 0.2 6 None
3 10.1 8 c
4 NaN -1 a
2. Filter the columns float_col and int_col from the DataFrame in one query.
Hint: use ix method of DataFrames. Print without using ix method.
3. Filter the records from float_col having a value greater than 0.15 and in a separate query, filter float_col value equal to 0.1.
4. Filter the records from the DataFrame which satisfies both the conditions float_col greater than 0.1 and int_col greater than 2.
5. Filter the records from the DataFrame which satisfies the conditions float_col not greater than 0.1.
6. Create a new DataFrame where column int_col is renamed to a new name.
7. Modify the existing DataFrame and rename the column int_col to a new name.
8. Drop the rows where values are missing from the DataFrame.
9. Change the missing value in column float_col as the mean value of the float_col
10. Change all the values of str_col with a new value and drop the missing values. The New value should have the prefix map_ and original value. For example, map_a, map_b.
11. Group all the values of str_col and find the mean of float_col in all the groups, respectively.
12. Find the covariance of float_col and int_col.
13. Find the correlation of float_col and int_col.
14. Create a DataFrame other having columns some_val and str_col with the given values:
some_val str_col
0 1 a
1 2 b
Perform inner join, outer join, left join, and right join with the DataFrame x.
15. When the same invitations are sent to many people, the body of the mail does not change. Only the name (and maybe address) needs to be changed. Mail merge is a process of doing this. Instead of writing each mail separately, we can have a template for the body of the mail and a list of names that can be merged.
Create a text file “names.txt” having the names: Anil Sunita Suman Lokesh Sumita John Johny
Create a text file “body.txt” having the body of the email as written below: I am going to Delhi. Let’s meet on 7th Jan 2018

Have a great day Regards Team Victory
Write a program to create separate files as Anil.txt, Sunita.txt, Suman.txt, etc. After picking names from names.txt. content of these files looks like the following: Anil.txt ----------------------- Hello Anil I am going to Delhi. Let’s meet on 7th Jan 2018 Have a great day Regards Team Victory ------------------------
Sunita.txt ----------------------- Hello Sunita I am going to Delhi. Let’s meet on 7th Jan 2018 Have a great day Regards Team Victory ------------------------

In [1]:
import numpy as np
import pandas as pd

In [35]:
# 1. Create a pandas DataFrame having the following structure:
# float_col int_col str_col
# 0 0.1 1 a
# 1 0.2 2 b
# 2 0.2 6 None
# 3 10.1 8 c
# 4 NaN -1 a


dict1 = {'float_col':[0.1, 0.2, 0.2, 10.1, np.nan], 'int_col':[1,2,6,8,-1], 'str_col':['a','b',None,'c','a']}

In [36]:
df = pd.DataFrame(dict1)

df

   float_col  int_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       c
4        NaN       -1       a

In [37]:
# 2. Filter the columns float_col and int_col from the DataFrame in one query.

df.iloc[:, :2]

   float_col  int_col
0        0.1        1
1        0.2        2
2        0.2        6
3       10.1        8
4        NaN       -1

In [38]:
df[['float_col', 'int_col']]

   float_col  int_col
0        0.1        1
1        0.2        2
2        0.2        6
3       10.1        8
4        NaN       -1

In [39]:
# 3. Filter the records from float_col having a value greater than 0.15 and in a separate query, filter float_col value equal to 0.1.

df[df['float_col'] > 0.15]

   float_col  int_col str_col
1        0.2        2       b
2        0.2        6    None
3       10.1        8       c

In [40]:
df[df['float_col'] == 0.1]

   float_col  int_col str_col
0        0.1        1       a

In [41]:
# 4. Filter the records from the DataFrame which satisfies both the conditions float_col greater than 0.1 and int_col greater than 2.

df[(df['float_col'] > 0.1) & (df['int_col'] > 2)]

   float_col  int_col str_col
2        0.2        6    None
3       10.1        8       c

In [42]:
# 5. Filter the records from the DataFrame which satisfies the conditions float_col not greater than 0.1.

df[~(df['float_col'] > 0.1)]

   float_col  int_col str_col
0        0.1        1       a
4        NaN       -1       a

In [43]:
# 6. Create a new DataFrame where column int_col is renamed to a new name.

df2 = df.copy()
df2.columns = ['float_col', 'int_col_renamed', 'str_col']

In [44]:
df2

   float_col  int_col_renamed str_col
0        0.1                1       a
1        0.2                2       b
2        0.2                6    None
3       10.1                8       c
4        NaN               -1       a

In [45]:
# 7. Modify the existing DataFrame and rename the column int_col to a new name.

df2.rename(columns={'float_col':'float_col_renamed'}, inplace=True)

In [46]:
df2

   float_col_renamed  int_col_renamed str_col
0                0.1                1       a
1                0.2                2       b
2                0.2                6    None
3               10.1                8       c
4                NaN               -1       a

In [47]:
# 8. Drop the rows where values are missing from the DataFrame.

df2

   float_col_renamed  int_col_renamed str_col
0                0.1                1       a
1                0.2                2       b
2                0.2                6    None
3               10.1                8       c
4                NaN               -1       a

In [48]:
df2.dropna(inplace=True) # changing in copy dataframe
df2

   float_col_renamed  int_col_renamed str_col
0                0.1                1       a
1                0.2                2       b
3               10.1                8       c

In [49]:
# 9. Change the missing value in column float_col as the mean value of the float_col

df

   float_col  int_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       c
4        NaN       -1       a

In [50]:
df['float_col'] = df['float_col'].fillna(df['float_col'].mean())

In [51]:
df

   float_col  int_col str_col
0       0.10        1       a
1       0.20        2       b
2       0.20        6    None
3      10.10        8       c
4       2.65       -1       a

In [53]:
# 10. Change all the values of str_col with a new value and drop the missing values. 
# The New value should have the prefix map_ and original value. For example, map_a, map_b.

df.dropna(inplace=True)
df['str_col'] = df['str_col'].apply(lambda x: 'map_' + x)

In [54]:
df

   float_col  int_col str_col
0       0.10        1   map_a
1       0.20        2   map_b
3      10.10        8   map_c
4       2.65       -1   map_a

In [55]:
# 11. Group all the values of str_col and find the mean of float_col in all the groups, respectively.

df.groupby('str_col').mean('float_col')

         float_col  int_col
str_col
map_a        1.375        0
map_b        0.200        2
map_c       10.100        8

In [56]:
# 12. Find the covariance of float_col and int_col.

df.cov()

           float_col    int_col
float_col  22.168958  15.341667
int_col    15.341667  15.000000

In [57]:
# 13. Find the correlation of float_col and int_col.

df.corr()

           float_col   int_col
float_col   1.000000  0.841307
int_col     0.841307  1.000000

In [58]:
# 14. Create a DataFrame other having columns some_val and str_col with the given values:
# some_val str_col
# 0 1 a
# 1 2 b
# Perform inner join, outer join, left join, and right join with the DataFrame x.


dict2 = {'some_val':[1,2], 'other_val':['a', 'b']}

df3 = pd.DataFrame(dict2)

In [59]:
df3

   some_val other_val
0         1         a
1         2         b

In [60]:
df

   float_col  int_col str_col
0       0.10        1   map_a
1       0.20        2   map_b
3      10.10        8   map_c
4       2.65       -1   map_a

In [63]:
# inner join

df.merge(df3, left_on='int_col', right_on='some_val', how='inner')

   float_col  int_col str_col  some_val other_val
0        0.1        1   map_a         1         a
1        0.2        2   map_b         2         b

In [61]:
# left join

df.merge(df3, left_on='int_col', right_on='some_val', how='left')

   float_col  int_col str_col  some_val other_val
0       0.10        1   map_a       1.0         a
1       0.20        2   map_b       2.0         b
2      10.10        8   map_c       NaN       NaN
3       2.65       -1   map_a       NaN       NaN

In [62]:
# right join

df.merge(df3, left_on='int_col', right_on='some_val', how='right')

   float_col  int_col str_col  some_val other_val
0        0.1        1   map_a         1         a
1        0.2        2   map_b         2         b

In [64]:
# outer join

df.merge(df3, left_on='int_col', right_on='some_val', how='outer')

   float_col  int_col str_col  some_val other_val
0       0.10        1   map_a       1.0         a
1       0.20        2   map_b       2.0         b
2      10.10        8   map_c       NaN       NaN
3       2.65       -1   map_a       NaN       NaN

In [65]:
# 15. When the same invitations are sent to many people, the body of the mail does not change. Only the name (and maybe address) needs to be changed. Mail merge is a process of doing this. Instead of writing each mail separately, we can have a template for the body of the mail and a list of names that can be merged.
# Create a text file “names.txt” having the names: Anil Sunita Suman Lokesh Sumita John Johny
# Create a text file “body.txt” having the body of the email as written below: I am going to Delhi. Let’s meet on 7th Jan 2018

# Have a great day Regards Team Victory
# Write a program to create separate files as Anil.txt, Sunita.txt, Suman.txt, etc. After picking names from names.txt. content of these files looks like the following: Anil.txt ----------------------- Hello Anil I am going to Delhi. Let’s meet on 7th Jan 2018 Have a great day Regards Team Victory ------------------------
# Sunita.txt ----------------------- Hello Sunita I am going to Delhi. Let’s meet on 7th Jan 2018 Have a great day Regards Team Victory ------------------------

In [74]:
f = open(r'C:\D\Python_25Sep21\M9_dataset\names.txt', 'r')
names = f.readlines()
f.close()

print(names)

['Anil\n', 'Sunita\n', 'Suman\n', 'Lokesh\n', 'Sumita\n', 'John\n', 'Johny']

In [75]:
f = open(r'C:\D\Python_25Sep21\M9_dataset\body.txt', 'r')
body = f.read()
f.close()

print(body)

I am going to Delhi. Let's meet on 7th Jan 2018

Have a great day
Regards
Team Victory

In [76]:
# correcting names

for i in range(len(names)-1):
    names[i] = names[i][:-1]

In [77]:
names

['Anil', 'Sunita', 'Suman', 'Lokesh', 'Sumita', 'John', 'Johny']

In [78]:
for i in names:
    s = 'Hello ' + i + '\n' + body
    f2 = open(f'C:\\D\\Python_25Sep21\\M9_dataset\\{i}.txt', 'w')
    f2.write(s)
    f2.close()